[{"category":"not useful","title":"Thank you so much. So ingormative. Is the xCode available for windows?"},{"category":"not useful","title":"Pretty cool :-)"},{"title":"Thank you so much for the tutorial! \n\nI have a question for you that you might be able to help me with. I'm wanting to build an app where users sign up for events...the tricky hard part is I want to collect the user data to build a database with it. How hard/impossible is that?","category":"not useful"},{"category":"not useful","title":"Great video. A lot of tutorials don't talk about the actual strategies!"},{"title":"First ☝️","category":"not useful"},{"category":"useful","title":"Hello.... Good explanations, but why you call this ( : ) a semicolon ?"},{"category":"useful","title":"Can we know how an app is coded ? \nHow it has been coded?\nPls reply"},{"category":"not useful","title":"Opened it up and all I had was a white screen :("},{"category":"not useful","title":"how do you build the sign you have in the background (on wall)?"},{"category":"useful","title":"hey, i set language as swift but what do i put as user interface, swiftUI or storyboard?"},{"category":"useful","title":"hey Chris, can you please release tutorials on making games on Xcode with  \"Game\" and other applications? would really appreciate it."},{"category":"useful","title":"Hello, Chris. I am not a Mac user. If I were to buy an ipad, could I do programming on that format or do I need to have a Macbook? If so, which ipad or macbook do you recommend?\nThank you."},{"category":"useful","title":"any reason why xcode app doesn't show? I'm only getting the xcode interactive app"},{"category":"not useful","title":"Bro !! This is soooooooo good !! Appreciate superb !!! Yup I went to the entire class!!! I need to watch it again !!! Am new on this ! And now that we are at social distance ! It’s perfect to relearn and to perfect  the skill !! Wow !! Again many thanks !!!  And yup I’ll be reaching for my certificate!!:)"},{"category":"not useful","title":"Why print (...) not creating? and output not error 😆😅😂"},{"category":"not useful","title":"thanks alot, really helpful!"},{"category":"useful","title":"Cause of the comments it looks like the tutorial actually sound like something good for once"},{"category":"useful","title":"Thanks For the great video \n but I'm getting a warning that sender.currenttitle should be used on main thread ...\n\nQuick fix ?"},{"category":"not useful","title":"thank you my bro please I wanna ask you about how to make update game in itenus connect"},{"category":"useful","title":"need more information on how to start working with the objects such as slider, text label, getting data from external  =sources"},{"category":"useful","title":"ah finally i already know thx i watch this for 3 hours aaaaaaaaaaaa"},{"title":"Chris, you're such a humble teacher - you instil confidence !!","category":"useful"},{"category":"not useful","title":"How can I resolve the \"Malformed config.xml file\" when I upload the .zip file please?"},{"title":"Read Everything!!! Hit download first 💪🏽","category":"not useful"},{"category":"not useful","title":"I didnt knew, App building is that simple. Now I can implement my ideas and also see a prototype myself. Appreciate for the simple and detailed video."},{"category":"not useful","title":"Please make a complete tutorial on Flutter."},{"category":"not useful","title":"Fantastic as always.  I think I speak for all of us when I say that it's ok if you steal a few minutes from providing excellent content to address that smoke detector."},{"title":"Please can you help me i need to covert my website into ios app","category":"not useful"},{"category":"useful","title":"Is it Swift or Objective C?"},{"category":"not useful","title":"hey i have a question i am running xcode 11 on mojave when i created a new project exactly like you why i dont see the main.storyboard"},{"category":"not useful","title":"Thank you sooooo much! Been wanting to create apps for YEARSSSS im great with PCs and STILL always found in daunting until I done it in 10 minutes! 👍"},{"category":"not useful","title":"Sir congratulations for 1 m"},{"category":"not useful","title":"Thank you so much man !\nWe don't deserve Derek Banas"},{"title":"Thank you Chris, I really enjoy the tutorial and learning fast from your video. I can see your enthusiasm that you put into every single instruction.","category":"useful"},{"title":"guy: what kind of music do u listen to?'\nSean Allen: I like comedy songs","category":"useful"},{"category":"useful","title":"I love it your tutorial, my goal for this years is to be a pro iOS Developer thanks for the great kick to start"},{"category":"not useful","title":"whenever I launched the app on the sim it would immediately quit. Can someone help?"},{"title":"Thank you. Previously I had not seen any other tutorials covering these steps related to build and the configuration file. I would love to eventually see the full submission process to ios and Android app stores.","category":"not useful"},{"title":"I was wondering how i creat a app that lets people order what ever it is that I’m selling straight from the seller off my app as me being the middle man pleas respond thank you","category":"useful"},{"title":"I'm looking for a guy, a programmer who makes simple apps for androidtv, android car etc. for android systems. . write me if interested.","category":"not useful"},{"title":"Tutorials that provide a false sense of hope and security to non developers","category":"useful"},{"category":"not useful","title":"do i need a iphone for a apple dev program"},{"category":"not useful","title":"i wasnt going to do it, but then you mentioned it works on windows phones and now im all in XD"},{"category":"not useful","title":"Hi Marco, great!  Could you help me with this question. Can I use what you described to make an app for an excel data sheet calculation that uses VBA? Would the excel formulas be protected?"},{"category":"not useful","title":"Intel had something similar, but better. It was called XDK but it's gone now"},{"category":"useful","title":"Thanx man, you just made it look easier even though mostly I did not understand what the heck was going on. Gave me motivation."},{"category":"not useful","title":"Thanks Michael. Great info. Quick question, if I want to use my Wordpress site for my app layout, what HTML info do I use and where do I source it? Thanks again"},{"category":"not useful","title":"Hi , when i want to build the app it just says failed << sorry for the bad English"},{"title":"Which programming language fits in  building apps?","category":"not useful"},{"category":"useful","title":"Hello! You have a lot of beginner tutorials. I would like to see some more advanced tutorials  from you. Have a good day! ;)"},{"category":"not useful","title":"Already pay for this course on Udemy app but it's so slow when video playback on APP and Udemy site, have you guys met this problem?"},{"category":"not useful","title":"wooohoooo says the new iOS developer 👌🏻"},{"title":"when I changed the label to something else and then ran the app it didn’t work it just said Hello, World! what happened?","category":"useful"},{"category":"not useful","title":"Anyone else get this error when you press the stepper?  *** Terminating app due to uncaught exception 'NSInvalidArgumentException', reason: '-[Tipper.ViewController spliStepperChange:]: unrecognized selector sent to instance 0x7fb7f8d09a90'\n\n\nAlso....\nCan't find keyplane that supports type 8 for keyboard iPhone-PortraitTruffle-DecimalPad; using 25739_PortraitTruffle_iPhone-Simple-Pad_Default"},{"category":"useful","title":"00:25 The Finished App\n01:30 What's Covered\n02:03 Installation\n02:33 Start Making the App\n03:31 Basic App Settings\n03:44 Create a Launch Screen\n04:45 Change Text Size\n05:07 Setup Developer Account\n06:00 Xcode Interface\n07:50 Designing App Icons\n09:33 Resizing Icons\n10:40 Create Multiple Icon Resolutions\n11:32 Load Icons in Xcode\n12:24 Creating the Interface\n12:45 Auto Layout\n13:37 Labels\n14:13 TextFields\n14:32 Views\n14:55 Change Device / Orientation\n15:28 Safe Area\n15:54 Stack Views\n16:25 Constraints\n21:22 Light & Dark Backgrounds\n24:34 Fixing Constraints\n29:00 Sliders\n31:10 Steppers\n35:38 Fixing Layout Errors\n36:50 Coding Our App\n37:23 Keyboard Settings\n38:32 Block TextField Edits\n39:01 Slider Settings\n39:26 Stepper Settings\n39:50 Connect Components to Code\n43:28 Handle Component Events\n45:55 Convert Strings to Double\n52:25 Program a Slider\n55:03 Change Component Values\n58:50 Program a Stepper\n59:52 Dismiss Keyboards\n1:04:10 Run on Simulator\n1:04:50 Run on Your Phone\n\n\n►► Get my Python Programming Bootcamp Series for $10 ( Expires Feb 19th ) : http://bit.ly/SavePython2 \n►► Highest Rated Python Udemy Course + 19 Hrs + 86 Videos + New Videos Every Week"},{"category":"not useful","title":"So many haters here. Great info, thanks for sharing."},{"title":"Angela explain well in her course, not too fast for beginner. I am a network engineer with background in computer science and learn this for hobby. Would love to see course from her on Android development.","category":"not useful"},{"title":"For more from Angela, Like this video, and share what you want to learn in the comments.","category":"useful"},{"category":"useful","title":"Hey Sean, just stumbled on one f your old gems, pretty awesome stuff, thank you very much!"},{"category":"useful","title":"Chris, thanks for this video! It helped me get started quickly. One thing I want the app to do is pick up where I left off if I close the app. I'd of course make a \"restart\" button to clear the score and start a new game. However I'm lost on getting the current score to come up after relaunching. Any guidance on how to do this?"},{"category":"useful","title":"Your videos have taught me so much, I’m actually looking to launch my first app based business by the end of next month and I’m comfortably building my own app! So excited! \n\nQuestion though for uploading our own images, what is the pixel density that you used for 1x, 2x, and 3x"},{"category":"useful","title":"My only access to a “computer “ is my Apple phone does this limit me to creating a working app even if I can down load these programs separately"},{"title":"I love you so much 💕dear","category":"not useful"},{"category":"useful","title":"Great video, thanks for being descriptive, I am completely new to this topic. Thanks"},{"title":"Nice Guide on Swift. I am a c# developer, Swift is kinda new for me. Can you show us how you build your first App with those facts? Best regards.","category":"useful"},{"category":"not useful","title":"not founded the dice image link?"},{"category":"not useful","title":"Thanks, Hooman. I'm going to start out with the Drag & Drop strategy. \nThanks again for sharing!"},{"category":"not useful","title":"Can you make a video on how to install your phonegap desktop 0.4.5? As I try it didnt work please help."},{"category":"useful","title":"I’m on minute 29 and I have both constraints on my screen but I have an error that says Conflicting Constraints. Please help"},{"category":"not useful","title":"I’m using Xcode 10.1 but every time I open a new project the “Library pane” on the low right corner does not pop up"},{"category":"useful","title":"The goal is to build an app. It's been difficult to remain consistent when learning Swift but I'm keen to start again by taking this course."},{"category":"not useful","title":"In ViewController i have an error that says “class ‘ViewController’ has no initializers. What did I do wrong?"},{"category":"not useful","title":"It's not Xcode 9 its Version 10.1 (10B61) ~ Does not have those button features. I think I'm being rigged. Help!"},{"category":"not useful","title":"What an excellent tutorial - concise and full of code/design pointers - no waffle or superfluous ramblings. Thank you making the video - much appreciated."},{"category":"useful","title":"Hey great video, but I can’t get the music to to play... I keep getting an error  in \nClass AppDelegate:\n    UIResponder,\n    UIApplicationDelegate\n- something to do with Thread 1: signal SIGABRT..\n\nIf you could help me out that would be awesome... thanks"},{"category":"useful","title":"You should've put iOS in the title."},{"title":"Best course, best teacher & most important BEST JOKES !","category":"not useful"},{"title":"how i build ios apps, if i have no mac os in my computer ?","category":"not useful"},{"category":"useful","title":"I’m going to make an app for my brothers business. Honestly, this is the best video on how to build an app. Everything is explained to where everyone can understand. Awesome video!!!"},{"category":"not useful","title":"dont for get to update to xcode 11 is out"},{"category":"not useful","title":"Good day. I want to learn how to build apps. Can you be of any help?"},{"category":"not useful","title":"How to create an app compatible on both iPhone and iPad? when i run this app (your GitHub )on iPad emulator, I face resolution problems. There is an button in bottom left for maximize and minimize"},{"category":"not useful","title":"My Rocket was perfectly aligned thank you for this tutorial, I'm coming from Android to IOS spent the last 3 hours trying to set up Firebase Auth because I wasn't understanding how to layout project in Xcode and this has given me a better understanding of what I'm doing.  Unlike Studio there isn't XML but I do like the drag function this seems more interactive in coding and kind of fun, just need to understand the logics a bit more.  \nThanks again!"},{"category":"useful","title":"There is no link in the description to download the pictures."},{"title":"Hello Sean!\nYou are the reason why I started with Swift! Thank you for your inspiration!\nHowever, I found a little error in my Swift program\nWhile I was watching your code on the line 29 with query.addFilter it`s on 19:14, my system didn`t give me an option of using addFilterPredicate, it seems that it doesn`t exist! Are there any options to do it differently?\nThank you in advance!","category":"useful"},{"title":"How do you get more than just one screen for your app? Like more pages","category":"useful"},{"title":"thanks for giving idea about changing icon/logo for application...once again thank uu","category":"not useful"},{"category":"useful","title":"im making a bullying based app on iphone this has been a lifesaver thx and i have never coded in my life thank you"},{"title":"HELLO thanks for this \nhow do i convert my wordpress website to an app for freee","category":"not useful"},{"category":"not useful","title":"Thanks for this. I made it at least half way through. I appreciate your time!"},{"category":"not useful","title":"Can someone please refund the time I wasted watching this video?"},{"category":"useful","title":"I am only 11 LOL make it easy :)"},{"category":"not useful","title":"wooo hoooo! Until now are unable to believe I just made 610 bux with this excellent web-site here, *Easy Laptop Life .c om*"},{"title":"Hey I can't reach to the link you given.... why???","category":"not useful"},{"category":"useful","title":"Yo thanks for this tutorial.. New Sub and I definitely dont regret investing 3 hours of my day doing this :) Keep it up man!"},{"category":"not useful","title":"When I try to up load file it say ..malformed config.xml.... What dose that mean"},{"category":"useful","title":"thank you for my first app on iOS!"},{"category":"useful","title":"Hi Chris, this tutorial was great and I'm looking forward to watching more.  I didn't see this question below, how would you have the game start out showing the card backs before you hit the Deal button?  Probably easy but I am fairly new to XCode.  Thanks."},{"title":"i would make you VP of my company in a heartbeat","category":"not useful"},{"category":"useful","title":"Who else is watching this in 2020 and is waiting for the 2020 series?"},{"category":"useful","title":"The tutorial is fantastic. Thank you for the extremely good work"},{"category":"not useful","title":"Can you help me create an APP."},{"category":"useful","title":"I just started the tutorials from 2018, thank u for making another one!"},{"category":"useful","title":"Mine doesn’t have a story board is there a reason for this?"},{"category":"useful","title":"Thanks Sean. I'm feeling like I can give this as go. :-)"},{"category":"useful","title":"Genuinely incredible tutorial. I've done a fair amount of coding already but this was absolutely perfect to get me started with Swift and iOS dev. Thanks Chris."},{"category":"useful","title":"14:39 there is no blue box pls help!!"},{"title":"Have an app idea but I dont even know how to turn on my laptop","category":"useful"},{"title":"Thank you so much!","category":"not useful"},{"category":"not useful","title":"Really great video, very well explained"},{"category":"useful","title":"Thank you for your quality content!"},{"category":"useful","title":"I'm just getting a white background with nothing else when I test this on my iPhone 6s. Could you please help?"},{"category":"useful","title":"Before I watch the whole thing will this apps that I am going to make will it work on Android? Please reply ASAP"},{"category":"useful","title":"Can you do this on windows?"},{"category":"not useful","title":"hustle-mode-code assets didn't open on my mac, what can I do or download to open the file?"},{"category":"useful","title":"Hello Chris, where is the worksheet for the playground? I couldn't find it."},{"title":"How do I download the Assets? Heelp","category":"not useful"},{"category":"not useful","title":"I keep on getting this error code, do you know what that means?\n\n\nThread 1: Exception: \"-[Music_Player.GenreButtonScrene genreButtonTapped:]: unrecognized selector sent to instance 0x100e0c3e0\""},{"category":"not useful","title":"For anyone watching this now, who paused the video and wondered which asset files/folders to move where; he continues to explain which files to move where later! So just download the assets from the video description, unzip, and then play the video again to see which files go where (and how)."},{"category":"not useful","title":"access denied to the links mentioned in the description."},{"title":"I'm already lost on the very first step. You're assuming people know where you're at in that first graphic. I have no idea where you started","category":"not useful"},{"category":"useful","title":"Thanks so much chris, shall i learn all codes in playground before this step? How much you think to get full experience if i start learn everyday? (approximately) \n\nThanks again ♥️"},{"title":"Hi teach tech can you please tell how to add logo to my app using phonegap , my app is built but adding a logo hs been a problem\nThank you.","category":"not useful"},{"title":"Hey Michael, your channel was recommended to me, and I have to say that I am mesmerized with your good looks, dude, you are sexy AF!!!!!  Lord have mercy!!!!!!","category":"not useful"},{"title":"Is there a way to run the code besides downloading the app and running it on a phone?","category":"useful"},{"category":"not useful","title":"Very good tutorial Angela. Clear, comprehensive, objective."},{"category":"not useful","title":"Hi Michael. Very cool!! Thanks."},{"title":"Dude thanks! I’ve never tried Swift in my life and I’m saving up for a macbook I’ve looked at allot of lessons of Objective C I didn’t understand it and I didn’t want to try and start it cause I didn’t even understand how the start functions work! But with you I’ve never done Swift and understanded 90% Of what you did and you were really helpful thanks!","category":"not useful"},{"category":"not useful","title":"Thank you, never stop teaching. You're a great teacher, love from Malaysia."},{"category":"not useful","title":"Hey there. Great video. One question... I followed the steps and when I scan the QR code it give me the option to go to link, which I do  then it brings me straight to Google lol..\nAny ideas?"},{"category":"not useful","title":"I like the flow and pace of video .... not like other videos ( slow ) .... Good Job! P.S: thought, you gonna sing at some point."},{"category":"useful","title":"Hy chris in my xcode there is no viewcontroller instead it has contentview can you help me out ?"},{"title":"Lol, I always make the same mistake of typing \"hellow\" instead of \"hello\"\n20:45","category":"not useful"},{"category":"useful","title":"Great tutorial! I made a working app - it's a great feeling!"},{"category":"useful","title":"Does this only work on Apple Music? or does it also work on Spotify and other music applications?"},{"category":"not useful","title":"Where is the working download link for the images"},{"category":"useful","title":"15:56 오토레이아웃 튜토리얼"},{"category":"useful","title":"Well done...Thank you for you effort."},{"category":"useful","title":"i watched like a movie ,never gets bored to learn with you,thanks for making such a good technology video.my first video without skiping i watched for 4hrs by recaping it again .AWESOME EXPERIENCE..............................................!\ni learnt a lot from it\nand also i want swift programming videos with optional and all related concepts in swift....hope u share those links."},{"title":"Great video Sean! I followed all the steps but when I hit a button on my phone, the app freezes and on Xcode I get this message \n\n\"This app has crashed because it attempted to access privacy-sensitive data without a usage description.  The app's Info.plist must contain an NSAppleMusicUsageDescription key with a string value explaining to the user how the app uses this data.\"\n\nAny pointers? again, great video. I enjoyed stumbling through it lol","category":"useful"},{"category":"useful","title":"Please help!!! When I open the assistent Editor XCode opens this file: UIViewController.h but not the ViewController. What can I do with this problem?"},{"category":"useful","title":"Thanks! Very helpful."},{"title":"When I run the program it’s telling me that there is an error in thread 1: signal SIGABRT after the leftimageview.image = UIImage(named: “card5”)\nNot sure what the issue is. Any help would be appreciated thank you. Ps awesome vid!!!","category":"useful"},{"category":"useful","title":"what about running the app on stores and monetizing it?"},{"category":"useful","title":"nice video it helped me a lot!"},{"title":"Chris - could you post the dimensions for each of the social media login images (e.i. 2x, 3x?","category":"useful"},{"category":"not useful","title":"Great app tutorial Thank You 😊"},{"category":"not useful","title":"Took me 20 minutes, which included finding + downloading a notepad app for Mac. Pretty cool!"},{"title":"Thanks for being so encouraging in lessons 6 and 7 on Coding for everything right now is confusing  (for I surely want to give up right now). The majority of your presentations has been good to follow so I'm looking forward to a quick rebound. I will take your word to learn Coding with practice.","category":"useful"},{"category":"not useful","title":"All your links doesn't work anymore"},{"category":"not useful","title":"made my first app which is awesome, but it tells me it is for an older version of android, so I can't see anything. Can you help me here?"},{"title":"Thanks for starting this series. Please make a weather app next. thanks.","category":"not useful"},{"title":"hey I need your help beaucse I tried on my way and then download your work made and I want to run yours and I don't have permission how that ?","category":"not useful"},{"category":"useful","title":"Great video - really like your enthusiasm :)"},{"category":"useful","title":"This is so nice, would like to learn more about apps writing"},{"category":"not useful","title":"Can I bring my website to phone gap in one sweep to create a new app?"},{"category":"useful","title":"Friend you know python also?"},{"category":"not useful","title":"Angela is a real delight to listen and learn from!"},{"title":"Hi, do you have any on line exercises or assignments for each lesson that you teach?","category":"useful"},{"category":"useful","title":"Being a game developer, I want to develop app size games, since people are on their phone more than home in front of their TV's/computers."},{"title":"Angela Yu: Yu  R an Angel","category":"not useful"},{"category":"not useful","title":"Fantastic Job Michael! I, like many programmers here, been looking for easy ways to make apps for all cellphone platforms. This turorial made it so easy. I am glad there are people like you in this world. You are a genious! From now on, I am using this way to build my cellphone apps. Thank you again for all this tutorials you have on your channel."},{"category":"useful","title":"Hello Christ, I have been following this tutorial and I got stack at. (where to locate the two circles joining together called Assistant Editor, which split the code editor into two different panes)"},{"category":"useful","title":"This video is by far the best most helpful video on YouTube on how to use Swift. Thank you very much."},{"category":"useful","title":"I was going to sub until I realised I’m already subbed from previously .\n\nThanks for the tutorial!"},{"category":"useful","title":"this video was everything I needed. thank you for your crazy effort :)"},{"category":"useful","title":"This is the best tutorial in the history of mankind."},{"title":"Yesss I’m excited always wanted to make my own app ❤️","category":"useful"},{"category":"not useful","title":"Thanks dude, your video was really helpful!"},{"category":"useful","title":"Also, I heard that iPhone took out the preview app. Banned from their app store."},{"category":"not useful","title":"does this teach you how to code as well?"},{"category":"useful","title":"This is the best tutorial ever!!! I wanna create an app where I can publish some stories.. I dont know how to create an app for that.. Can I earn through it?"},{"category":"not useful","title":"Hey everyone, I’m currently trying to find out how one could make the lives of people who learns iOS development a lot easier \nWhich is why I have two very simple questions:\n- As a person who learns iOS development or wants to get better at it, what are the 2 biggest issues you’re dealing with?\n- Have you experienced feeling that you’re good enough to get a job that you really want but something is holding you back to prove that to interviewers or HRs?"},{"category":"not useful","title":"Can I use the images in an app?"},{"category":"useful","title":"Great tutorial, thank you so much!"},{"category":"not useful","title":"Awesome starting point tutorial! Got me started right up with the basics - importing assets and linking items. Thank you!"},{"category":"not useful","title":"Again YouTube is reading my mind."},{"category":"not useful","title":"Man I know how that would feel like!"},{"category":"useful","title":"if i could ban you from using youtube, i would do it with pleasure. All those link in the description were not directing."},{"title":"Hi, who come you can have your first application on your phone. Can I download an application from Xcode to my phone without being in AppStore ?","category":"useful"},{"category":"not useful","title":"This is the best ios app development course i have seen ever"},{"category":"not useful","title":"thank you"},{"category":"useful","title":"How do you get the app downloaded on to your iphone from your computer?"},{"title":"whenever I create a new project there is no main.storyboard. only launchscreen.storyboard. does anybody know how to fix this?","category":"useful"},{"category":"not useful","title":"Thank you so much for helping me to create my first App!"},{"category":"useful","title":"Uhu what a day, happy valentine's day Derek banas."},{"category":"not useful","title":"Awesome video dude. Thanks a lot!"},{"category":"not useful","title":"Great! After this series ends, Please make an Android Development series. There are a lot Android Development tutorials but all of them lack many things, even the ones made by Google, why you're tutorials seems a lot programmer-friendly and    awesome..."},{"title":"Him: Ramble Ramble Ramble","category":"not useful"},{"category":"not useful","title":"So u can make anything like amazon or games fitness app with this app this is cool going to get started on coding"},{"category":"useful","title":"I bought this course and it's been one of the most exciting and memorable moments of my life. Thanks to Angela I discover that programming is not difficult and it really helped me to understand logic and sintax. \n\nThank you Angela <3 \nMy fear for coding is gone and I'm looking forward to continue learning!"},{"title":"Such a good video. Crisp and clear to start building iOS app.\nThankyou Derek","category":"not useful"},{"category":"not useful","title":"Great demo of using Phonegap. It's such a good tool to use in combo with others when you're building a no-code app. Thanks for the walk through!"},{"category":"useful","title":"Excellent !! I tried it and it's work flawlessy...thank u very much !"},{"category":"not useful","title":"How can I input blogger in my app?"},{"category":"useful","title":"Thank you so much for this tutorial! it's very useful for learning how to use Xcode and iOS development."},{"category":"useful","title":"“Hello word”\nAnyone who took coding class (not all) would know the term"},{"title":"Best Teaching ever had an online platform","category":"not useful"},{"category":"not useful","title":"Amazing, this really helped me alot thanks."},{"title":"i just need A Little more Help thats all :)","category":"useful"},{"category":"not useful","title":"The first link didn't work, and when I found it it said it cost??? thought it was all supposed to be freee????"},{"category":"not useful","title":"In 2018 right now the iOS 12 beta was uploaded and it destroyed my phone."},{"category":"useful","title":"I’m going to use this to get my not yet to be existent game, on the App Store. Any advise for new programmers?"},{"category":"not useful","title":"Hey I am already hooked watching your videos. I am working on my own app for about a year now (still not complete the way I want it) and I came this far along by watching your videos and couple other iOS developers out there like Mark Moeykens and Angela Yu. Thank you guys a million for helping begineers like us."},{"category":"useful","title":"I just say Omg I thank you a lot I got a lot of knowledge now ty again ><"},{"category":"not useful","title":"I would like to learn how to add pins to a map with a given time or distance from a startpoint."},{"title":"CodewithChris,\nI have review several of the comments below concerning your technique and performance of tutorials address.  Each comment has a positive review of matter type. THANK YOU so much for this service you have provided to this app directions.  The formula is simple answer much easy to follow.  You are the Navigator","category":"useful"},{"category":"useful","title":"Awesome video! Really helpful. Greetings from California!"},{"title":"Hey, I've followed all the instructions up till the very end. I don't know how to send the app to my phone, though. Or the app store??? Can you help?","category":"useful"},{"category":"not useful","title":"I'm getting \"error index.html not found\" but my files are both in the zip folder im attmepting to upload"},{"title":"Thank you so much 💙","category":"useful"},{"category":"useful","title":"Woo.....Fantastic!! Thumbs up! Good man!"},{"category":"not useful","title":"Thank you Angela Yu, you are wonderful."},{"category":"useful","title":"I want to be ur trainee, u are so good at teaching :)"},{"category":"not useful","title":"“Xxode cant be installed on “macintosh HD” because macOs version 10.14.3 or later is required” this pops up whenever I try to install xocode. What should I do?"},{"category":"not useful","title":"I am working on C programming right now...and i want to move to swift...how long journey it would be? what do you think? any advice also...? thanks in advance!"},{"category":"useful","title":"is the first link for the source code in the description can that be used for Swift 4.2??"},{"title":"I needed this tutorial. Thank you!","category":"useful"},{"category":"not useful","title":"One of the best udemy courses I've ever taken."},{"title":"I must made an app and I'm so happy!!!  Thank you!","category":"not useful"},{"category":"useful","title":"Hello Chris, great stuff, just one quick question. I received an error when I was trying to  use the random number method \" Int.random(1...14)\" . XCode shows that the Type Int does not have the member  'random'. How do I solve that issue? Thanks a lot! :D"},{"category":"useful","title":"very good.  I want to practice it, thanks a lot"},{"category":"not useful","title":"i cant save my\"config.xml\" it says i should contact the administrator for permission"},{"category":"useful","title":"Nice . *Can you make a video about computer network like CCNA.*"},{"category":"not useful","title":"You deserve so many more subscribers! Thanks a lot mate!"},{"category":"useful","title":"Thanks Derek. I followed your advice for growing my channel, and I am about to complete my first 1000 subs. I started some months back."},{"category":"useful","title":"Great work!"},{"category":"useful","title":"You are absolutely amazing! I've studied Data Science, so I only handled R / Python/ SQL and now doing this I am so excited ahaha. Seeing what I am building is so exciting!! Thank you again"},{"title":"Loved the video. Thanks for posting. I want to build an app that shows me how to calculate percentages of chlorine to use in my soft washing business. Apps are available for Androids, but not IOS. I know I have a long way to go!!","category":"not useful"},{"category":"useful","title":"I like how he's so chill.  Very calm demeanor."},{"category":"not useful","title":"Great content, thank you for taking the time to this tutorial."},{"category":"not useful","title":"Whenever I try to drag the card image to the assistant editor, it won't let me place it anywhere. Do you know why? My code matches the code in the video exactly."},{"category":"not useful","title":"I can't find \"darkBlueBG\". Why my selection is blank?"},{"title":"@6:50 My hard drive was completley wiped too! I lost ten-year-old photos. Shouldn't Apple be held responsible for this mess? I hope someone files a lawsuit.","category":"not useful"},{"category":"useful","title":"I'VE NEVER SEEN SOMETHING SO HELPFUL LIKE THIS VIDEO"},{"category":"not useful","title":"Thank you for your tutorial. I just want to mention at the beginning it was giving me white screen then I placed the sound file on build phases---> copy bundlle resources  and it worked just fine."},{"category":"not useful","title":"How do you create it for both?"},{"category":"useful","title":"Hello Chris! I'm completely new to coding and want to make an app that's similar to PayPal. Can I make an app like this with Xcode?"},{"title":"i was literally watching you at 1.25 the speed half of the entire video, i was like damn you going so fast, my dumba","category":"useful"},{"category":"not useful","title":"Do I have to buy the 27” 4k retina or is the 21” 4k retina good enough for making apps? (No game apps)"},{"category":"useful","title":"ITS LIKE A MOVIE WITH ALL LESSONS TOGETHER, SO RELAXING!"},{"category":"useful","title":"Wow, I just built my first app! I keep tapping the buttons I’m so amazed! Great video!"},{"title":"It compiles, but when I open the app, there is a blank, and I get Thread 1: signal SIGABRT on Xcode, wish to know why.","category":"useful"},{"category":"useful","title":"What to do if I already have a website and want to make a app for that and monetize it?"},{"category":"not useful","title":"Awesome"},{"title":"It tells me that i need to have OS X version 10.12.6, is there anything I can do to resolve this? It's a mid 2014 Mac.","category":"useful"},{"category":"not useful","title":"Hello from TikTok."},{"category":"not useful","title":"Very good lesson do you teach anywhere? I would love to attend one of your class. please let me know PSOJ23@gmail.com"},{"category":"useful","title":"I'm assuming my \"User interface\" should be SwiftUI? Right?"},{"category":"not useful","title":"I have Windows laptop can I learn iOS in this coz I can't effort apple laptop plz reply"},{"category":"not useful","title":"'I am poor' challenge? - would help if I knew where/what they are"},{"title":"Great teaching. Thank you","category":"not useful"},{"category":"useful","title":"Hey chris, Thank you for the tutorial but i cant find the library button.\ncommand shift and L is not working either its just making sounds\n\nSubbed BTW!!!"},{"category":"useful","title":"Chirs, I am so confuse right now, i want to learn python and also want to make money by making apps!\nWhich ones should i choose first? And Im also a beginer with coding!"},{"category":"useful","title":"Everyone, for MacOS Mojave Xcode beta users, the object directory is a button on the top of the window now with a square inside a circle."},{"category":"useful","title":"what about an app icon?"},{"title":"please make a laravel and vue.js tutorial. it will go viral","category":"not useful"},{"category":"useful","title":"Let me know if you like this video format or if I can improve in any way! :)"},{"category":"useful","title":"I want to create an App for my church that would allow me to upload words to music & the actual music. Is this possible for an App?"},{"category":"useful","title":"Hello, thank you so much for this video! I just have a question: what if I wanna convert my app from iOS to android? Will I need to code a “new” app which will be compatible to the android phone?"},{"category":"useful","title":"Where can I find those images? Because I couldn’t find it"},{"category":"useful","title":"Just created my FIRST app! Thank you!\n\nChris, until last summer I had no previous knowledge in coding. But when I first thought about whether I should approach it or not, it was your channel that gave me the confidence to do so! It’s just a few months later, and my first text adventure app, Altered: Starless Night, is now available on the iTunes App Store:\nhttps://apps.apple.com/us/app/altered-starless-night/id1492153099\n\nThank you so much for your great work!"},{"category":"not useful","title":"Hi, got a question here. I forgot to add (com.) in front of my organisation identifier when I started my project. Now my project is finished is there still a way to add it?"},{"category":"useful","title":"I would like to create a website like yours. Can you tell me from where did you got the website template or did you code the website on your own?"},{"category":"not useful","title":"beautiful"},{"category":"useful","title":"Wow, if people with no programming g experience can follow along, means that this video is good 8D. I'm programmer but not into mobile, gonna watch this later on!"},{"category":"not useful","title":"A great tutorial for Xcode, but would be great to teach Swift and basic programming concepts in a separate video. A bit slow going for experienced programmers who want to build an app quickly."},{"category":"useful","title":"Hi Sean, I keep  getting this  pop up when trying to play the songs using the buttons called \"Thread 1: signal SIGABRT\" and I cannot function the app. Please help soon! Thank you if you do!"},{"category":"not useful","title":"Please made a video about \"MathML\"."},{"category":"useful","title":"I actually learnt chrome editing with inspect element"},{"category":"useful","title":"Hey Chris, thanks for the video! Tho I started last year before xCode updated, this video comes in very handy. Keep the good work up! 👍👌"},{"category":"not useful","title":"I started learning basic Swift awhile ago and decided to jump into making a basic app just for fun. Very good tutorial! I actually somewhat understand what's going on 😮 I ran the app on my phone and the app crashes when I tap \"calculate\" before inputting a price and sales tax.\n        }"},{"category":"useful","title":"Hi, Chris! Do we also have the second video for this one ? At least.... :) thanks, i'll appreciate if you answer. I am 34 and want to learn this. Kind regards"},{"title":"How did you learn coding","category":"not useful"},{"category":"useful","title":"Hey Sean, great videos. I'm really learning a lot as a total beginner. Could you please help me out with a problem I can't seem to solve or find anywhere on youtube. I've created a custom tableCell with a uibutton inside that changes states when tapped. (a checkbox image on and off) However, when scrolling the tableView up and down and the cells recycle its copying the selected state to the next set of cells. It's basically a to-do app that lets the user add and remove tasks, but I need to set the uibutton back to default (unchecked image) when a new cell is created and doesn't affect the recycled cells. \nI think a video demonstration on this topic would help so many people needing to save a uibuttons state. Thanks and keep up the great videos."},{"category":"useful","title":"I want to build an app and I appreciate this free lesson to help people get a leg up in this competitive industry. You da man Chris!"},{"category":"not useful","title":"Great Tutorial! Thanks :)"},{"category":"useful","title":"This is awesome!!! Thank you so much. Yesterday the idea of coding an app seemed impossible, and I have expected to get lost soon and bail as I did with PHP, but I actually understand this."},{"category":"not useful","title":"Great video, I followed along the entire way and have no doubt it would have been a successful first app, however, my computer is too slow to function while xcode is running. I've tried xcode 10 and xcode 9, but my 2011 macbook cant handle it. Any suggestion for the oldest model mac I can get to run xcode?"},{"category":"not useful","title":"wow great tutorial on swift development"},{"category":"useful","title":"Nice way to make people want to start swift, good work!"},{"title":"How do I do this for android? I want to start in android and move it to IOs","category":"useful"},{"title":"Hi, So happy to have found you're channel as I'm interested in building an app but also don't know anything, but I'm blessed to have found you're page. Question? How long would it take a beginner to learn how to create an app, months, years? Thank you for you're response in advance 😊","category":"useful"},{"category":"not useful","title":"If I download the \"deploy APK file\" on Android and install my app, first time by running my app a popup appears which tells the user that the app is made for an older android-version....I searched for a solution but had no success yet..."},{"category":"useful","title":"i dont have Photoshop... and im having trouble with adding an imagine.. can someone help me?"},{"title":"Derek Banas Has no blood. He has code in his body. Lol","category":"not useful"},{"category":"useful","title":"Is x code the only language to build an app in? I’ve learned some python coding. I was wondering if python can be used to build an app or is x code better to use for app building?"},{"category":"not useful","title":"This certainly saves a lot of time and headaches. Great tutorial!"},{"category":"useful","title":"My background doest goes to edge to edge even ihave uncheck margin and choose view"},{"category":"useful","title":"Great video man! Love how much you love this stuff!"},{"category":"useful","title":"I plan on making a game. Love this video, definitely going to be using your series as the baseline for the creation of this game. Thank you for your work in putting this together."},{"category":"useful","title":"I’m trying to make a music streaming app I’m 20 minutes in this video will this help me in that aspect or do you have a video that can help me with that"},{"title":"Is there a CMD+Key combination that will emulate the trackpad pinching?","category":"not useful"},{"category":"useful","title":"There's a way for use Xcode for Windows?"},{"category":"not useful","title":"黑苹果也行"},{"category":"not useful","title":"Very helpful viedo...created my first app Hustle Mode: ON :)"},{"category":"not useful","title":"Thank you for the video! I just have one problem. On minute 14:36 I can't add the second nor the third button to the IBAction function. I press control and drag the line to the function but the blue highlighted box doesn't appear. If someone could help me it would be great. Thanks!"},{"category":"not useful","title":"Great!\n\nA very well made, informative video - hard to find!\nI have liked the video and subscribed to your Channel, hope to watch more of your videos in future!\n\n Thanks! 👍🏽"},{"title":"Thanks Angela, great video with clear explanation. Much appreciate.","category":"not useful"},{"category":"useful","title":"I have trouble dragging the picture layer, around 43min of the tutorial."},{"category":"not useful","title":"Nice"},{"title":"Love how he explained it 👏🏽 deserves more subs","category":"useful"},{"title":"Missing your storyboard? See: https://youtu.be/ea9fCSXGhSU ⚡QOTD: Is Swift and iOS your first try at programming? Let me know below!\n👇 Kick start your own app with my free 7 Day App Action Plan ➡️ http://bit.ly/7dplan","category":"useful"},{"title":"Amazing video, however when i hit a button on my phone, there is no music playing.Code, info.plist are fine and no crashes whatsoever. Please advise, thanks!","category":"useful"},{"title":"their documentation sucks. Seriously. Android documentation is way better. But macbook pro and iphone are so pretty.","category":"not useful"},{"category":"useful","title":"i dont know anyone who works for 5 dollar for one hour"},{"category":"not useful","title":"When I built this application following your tutorial, I received the: \"Thread 1: signal SIGABRT\" error. Any reason why that could be happening?\n\n\n*** Terminating app due to uncaught exception 'NSUnknownKeyException', reason: '[<FirstApp.ViewController 0x7fc9d8802d10> setValue:forUndefinedKey:]: this class is not key value coding-compliant for the key Calculator.'"},{"category":"not useful","title":"Thank you for this interesting video. I just tried this example http://demos.jquerymobile.com/1.4.0/pages-multi-page/index.html the problem is the apk in the mobile displays the two pages in the same time !! Any idea why ?"},{"category":"useful","title":"You are a Hero Sir! Thank You for your work and patience to explain everything for beginners like me. It was fun to go along with You for over 3 hours. Looking forward to the beginner-course ;)"},{"category":"useful","title":"Chris, I’m stuck at the start of lesson 5. My playground says running but won’t actually run. What do I do?"},{"category":"not useful","title":"Have been waiting for the iOS tutorial forever. Thank you."},{"category":"useful","title":"Great video man!"},{"category":"not useful","title":"MIT App Inventor is another great app for beginners looking to quickly and easily create apps."},{"category":"useful","title":"Hi Chris, thank's for this awesome tutorial, it's a great point to started with iOS development."},{"category":"useful","title":"Thank you Sean, and thank you for your service back in the Day."},{"category":"not useful","title":"14:39 there is no blue box pls help!!"},{"category":"not useful","title":"Hello from TikTok."},{"title":"Thank You !! It's really a good introduction..","category":"not useful"},{"category":"not useful","title":"Other: Download App in 6-8 Hours!\nMe: Airdrop from My Friends for just 15 minutes!"},{"category":"not useful","title":"Did you use Photoshop to create the images? What did you use to make the sound effect as well? Great video btw, helped med alot!"},{"category":"not useful","title":"thank you"},{"category":"not useful","title":"you are awesome i am very happy with your lectures"},{"category":"not useful","title":"Hi"},{"category":"not useful","title":"nooooooooooooo they say something is missing from the app"},{"category":"not useful","title":"CAN YOU PLEASE UPLOAD THE FINAL COPY"},{"title":"Thanks Chris, these tutorials are awesome!\n\nWork for Apple currently so got interested in iOS development :)","category":"useful"},{"title":"Where is the links of the dice app icons?","category":"not useful"},{"category":"useful","title":"Thanks Derek , you da best man !\nHope it makes you as happy as I become to see a notification for your new video upload"},{"category":"useful","title":"I want to build an app where people can talk to each other with a chat or call, what do you recommend me to do?"},{"category":"not useful","title":"I do t have mac"},{"title":"Wait would using a virtual machine work?","category":"not useful"},{"category":"useful","title":"Sometimes I just want to get straight to the \"how-to\" instead of \"what is\"... That is, not too much of basics and long stories.\nWhenever I want to be up and running quickly, Derek is my guy! He clears the ground fast"},{"category":"not useful","title":"Best course yet"},{"category":"not useful","title":"You’re heaven sent. 🤙🏾 thanks!"},{"category":"useful","title":"Hey Chris, thank you for this amazing tutorial.  I added a reset button, which when tapped resets the scores and shows an alert declaring the winner. Initially I tried to display  a popup instead of an alert,  but couldn't follow along the tutorials which used older versions of Xcode (mine is Xcode 11). Can you please make a tutorial using Xcode 11 to display pop-ups?  Thanks in advance."},{"category":"not useful","title":"I'm really so grateful I can now support my family thanks to *Get Pa idHom e .com*"},{"category":"not useful","title":"Thanks for your video. Can we develop app for iOS in Windows platform?"},{"title":"Couldn't get it to work on W10 Pro N. Thankfully there's Cordova.","category":"not useful"},{"category":"useful","title":"My laptop is Windows as can’t  download what substitutional of Xcode foe windows?"},{"category":"not useful","title":"20:40 it says for playGenre use of unresolved identifier"},{"category":"useful","title":"Four words: YOU ARE THE MAN!!"},{"category":"not useful","title":"Thank you so much for this video! You do not understand how much you helped me!"},{"category":"not useful","title":"I'm about 45 minutes in. Great tutorial. Concise but thorough. Excellent focus on key topics that are relevant to the app we're creating. Absolutely brilliant! Thanks, Derek!"},{"title":"Hey man, I love your videos, is there going to be a series for 2020? I’m disabled and have wanted to create an app for years but I’m absolutely trash at coding and your videos are very inspiring and I’m learning a little bit. Thank you for the video man.","category":"useful"},{"category":"not useful","title":"40:20"},{"category":"not useful","title":"Time wasting video.. guys there's a lot of ways either learn programming or to build apps without programming or with a liiiittle bit of knowledge about programming and all tutorials are available AND FOR FREE and are also good quality.. this kind of youtubers make videos about anything just to sell products and they don't really care if you get what you're looking for and there are many out there."},{"title":"Having trouble finding the buttons on Xcode 10.1?","category":"useful"},{"title":"Amazing! I loved the tutorial and had fun exploring with additional game features like ties! Thank you so much!!","category":"useful"},{"title":"problem is not getting solved!! every time you refer me to watch another video..and this is my third in this series!!","category":"not useful"},{"title":"Forever Heart Asian Women Like U Angela Yu","category":"not useful"},{"title":"Hey Chris what equipment are you using to record your voice for your videos? Thanks","category":"useful"},{"category":"useful","title":"Chris, you are the teacher I never had in college.  Great tutorial and excellent way of teaching. Please consider doing a tutorial on machine learning"},{"category":"not useful","title":"Wow!! you made it look so easy. WHY?"},{"title":"I keep getting a white border around my backgrounds does any1 know any idea why ? 😊","category":"useful"},{"category":"not useful","title":"love this thank you! looking to develop an app for my online software program , if anyone wants to help DM\nme at JeffTheEntrpreneur on IG - if you know of Grant Cardone you are qualified"},{"category":"useful","title":"Great video.... I definitely picked up very quickly. Question, where can I find the social media png's (Facebook, email, google) you mentioned @36:51?"},{"category":"useful","title":"Omg this is awesome I’m gonna try this"},{"category":"not useful","title":"tell me the use of auto layout for the responsive UI"},{"category":"not useful","title":"1:25:30 😂"},{"title":"Dude, you are an amazing teacher","category":"useful"},{"title":"hey man, I just bought an iMac and I want to install Xcode 10 beta 4 but I didnt really understood what the problem might be!?","category":"not useful"},{"category":"not useful","title":"When I built this application following your tutorial, I received the: \"Thread 1: signal SIGABRT\" error. Any reason why that could be happening?\n\n\n*** Terminating app due to uncaught exception 'NSUnknownKeyException', reason: '[<FirstApp.ViewController 0x7fc9d8802d10> setValue:forUndefinedKey:]: this class is not key value coding-compliant for the key Calculator.'"},{"title":"In xcode 10.2 drop a vertical stack view object to the view controller.","category":"not useful"},{"title":"Do you have a twitter account?","category":"not useful"},{"title":"Can you please teach us how to add admob ads to our phonegap projects? Thanks 🙏. I love ur vids u are best explainer ❤️❤️","category":"useful"},{"category":"not useful","title":"Udemy  i was studided economics my BA but i to code so was start study computer scince but i am not continue after 1st year of study  If you can pleace tell me what should i do.i subscribed you thank you"},{"title":"I have a great app idea. I have no clue how to code and create one can someone do this for me? \nIf it’s successful we share the profit?","category":"useful"},{"title":"Thank you master Banas ! very helpful & effective lesson for us that's just starting out on iOS Development","category":"not useful"},{"category":"useful","title":"I’m only 15 but I want to start this project and finish it which I usually don’t finish anything I start.."},{"title":"Thank you for this awesome tutorial!!","category":"not useful"},{"category":"useful","title":"I'm new to Swift.... Really this video make me perfect... Thanks for being help for us.."},{"category":"not useful","title":"Hey! i love the concept but it does'nt seem to work for IOS, any thoughts on this?"},{"title":"Great, Informing videos Sean! Much appreciated.\nBest of luck :)","category":"useful"},{"category":"not useful","title":"Thank you so much, I really appreciate your help.\nGracias"},{"title":"Only a few people want to learn stuff like this. Hopefully I learn all of these coding stuff so I can make a good app and earn money. Thanks 🙏 for this lengthy video but,(like my dad says) you got to work for free so that later you get paid 💰💰💰","category":"useful"},{"category":"useful","title":"I thank you a lot but I have a question how can I full background it alway in safe area by the way thank you a lot ><"},{"category":"not useful","title":"I have a question. Can i make an app to find something by taking a pacture of what i need?"},{"category":"useful","title":"Is this course still valid for ios 12  October 2019 ?"},{"category":"not useful","title":"Angela Yu Smile so beautifully I Love Asian Women Good Job"},{"category":"useful","title":"Let's run this? How do you install it in your phone?"},{"title":"Thank you! Finally a tutorial that gets us hands-on without going into a deep-dive on all the options in the app. This was fun!","category":"not useful"},{"title":"This is by far the best tutorial video, I have found so as I am very new to App Development. \nOne question, I am not able to find the link anywhere to download image files. Can you please post that link in your response?","category":"useful"},{"category":"not useful","title":"Hello teaching tech. Can you build me an app. Reach out to me. So we can talk more. It would be a simple app too."},{"category":"not useful","title":"what size do images need to be when uploading? like what size does the background image need to be?"},{"category":"not useful","title":"What is that artwork in the background? Did you build that on your 3D printer? Do you have a tutorial on how you made the artwork? Impressive.  myradiantface.com"},{"category":"not useful","title":"Make hybrid app using ionic please"},{"title":"I wanna make a aesthetic fitness app where u get cute motivational messages like ‘u can do it!’ u register ur favourite actor/ actress and u get special photos everytime u  complete a workout","category":"useful"},{"category":"not useful","title":"This is pretty cool. Have you thought about making videos about PWAs?"},{"category":"useful","title":"MakeSchool sent me here, so you must be doing an awesome job!"},{"category":"not useful","title":"Excellent! You are the kind who can simplify things."},{"title":"Thoughts on Flutter & React Native?","category":"not useful"},{"category":"useful","title":"I want to build an app for employees to have quick access to our protocols for our ambulance district"},{"category":"useful","title":"I want to make an app that’s a filter for photos"},{"category":"useful","title":"Hello i will definitely be creating an app here shortly thanks to you on iOS <3 but would you also happen to know any good ways to make the same app for android as well?"},{"title":"Having issues no errors being found through the xcode debugger. Every button runs smoothly except when I press the stop button my app won't allow me to play any other genre.","category":"not useful"},{"title":"Why there is no Join button near your subscribe button? That button will help your channel to grow even more :)","category":"useful"},{"category":"not useful","title":"Please make more of these! (Y)"},{"category":"not useful","title":"Hey ! nice Job, someone know why the sound found in emulator but in real phone its dosnt fount ? ty for the video!"},{"title":"nice one Micheal, please how can a pdf display in your fininshed phonegap project","category":"not useful"},{"category":"useful","title":"PLEASE PLEASE PLEASE PLEASE DO THIS FOR ANDROID SIR PLEASE \nTHE OLD VIDEOS ARE GREAT BUT COULD REALLY USE A NICE UPDATE\nPLEASE"},{"category":"useful","title":"Hi I'm 13 recently we had a project of an idea for an app  and mine is YBM alert and my teachers are static about it hopefully  this works trying to develop this app"},{"title":"Can you make same things with python or js? Just for comparison","category":"not useful"},{"category":"useful","title":"Hey Chris, Just subbed! Love your content! Can you create an app if the name is already taken? If the bundle identifier is different?"},{"category":"not useful","title":"A very weak definition of an \"application\", it's a web page and I'm guessing you just have a bit of space available for your web resources. It's simply the browser that defines whether it works or not, so it depends entirely on how secure your browser is and whether their widgets are executable on your browser."},{"title":"You made it easy to understand code. Something I didn’t think I could comprehend. You’re amazing! Thank you.❤️","category":"useful"},{"title":"I had purchased her Web development course it was really good,now my mac is about to arrive this is the first thing i intend to learn on that machine .Thanks Angela for this wonderful course at such a affordable price!","category":"not useful"},{"category":"useful","title":"Hi Chris, I'm loving your tutorial, it's really great than those out there in Skillshare, I feel like they are not well oriented classes. Thank you so much for giving us this.\n\nI'm on Xcode 11.3.1, and I cannot see any status bar icons in the main.storyboard, regardless of the device. I cannot see the time and battery status there.\n\nAnd also Constraints for background image is totally different here on my Xcode 11.3, I cannot put them on zeros by clicking view \"current distance\", it just jumps back to 'standard' when I hit  enter, so the background image is not stretched. Is it because that I am using a newer version of Xcode?\n\nAnd will you be able to answer the personal questions when I sign up for the full class of yours? I am thinking about joining for the Full Bundle class. I apologize for asking too much questions. Thank you so much."},{"category":"useful","title":"Nice way to make people want to start swift, good work!"},{"category":"not useful","title":"Can someone help me I CANT FIND THE IMAGE FILES !!"},{"category":"useful","title":"Youtube is why I have a problem with going to college."},{"title":"Hey Chris, thank you so much, just finished the course and it was very very helpful! Can't wait to build my app, cheers","category":"not useful"},{"category":"useful","title":"Useful Tip: Instead of holding the ^ key and dragging your mouse, you can simply right click the object and drag a line over to the code."},{"category":"not useful","title":"the updated app was still version 0.0.1"},{"category":"useful","title":"thanks for sharing this tutorial, this helps me to boost up my motivation in my journey to ios devt. it would be a great help if you can update this by adding volume slider, maybe... i have tried, but no luck. thanks again."},{"title":"when I boot the program i get this error:\nThread 1: breakpoint 1.4\non AppDelegate.swift point 12 that says:\nclass AppDelegate: UIResponder, UIApplicationDelegate {","category":"not useful"},{"category":"useful","title":"Woohoo. First app down. Few minor Glitches(Im a moron) and a Signal Sigabart issue. But all sorted. Awesome video mate, will need to check out more :D"},{"category":"useful","title":"Hi Chris. Thanks for unbelievable work you do. I am trying to create a simpel, internal app like Tips app from Apple for my small business employes with push notifications. It Cant be so difficult. What you think, Witch of your videos should I se and lern?"},{"category":"not useful","title":"Please Can You Help and Do Tutorial On How To Insert Google Ads(Admob) on the app, Please In The Name Of God"},{"category":"not useful","title":"I  am everywhere in youtube, Ladies and gentlemen"},{"category":"useful","title":"Me watching the whole video even though i wont make one ☝️"},{"category":"useful","title":"I’m very happy I’ve came here bc I’m very interested in making apps and just having fun being creative with code but yeah the problem in that is I don’t know how to code sadly but understand how everything works"},{"category":"useful","title":"Suppose I wanted make an app that accesses a particular piece of hardware through my phone? Is that possible? If so, what would I need to do?"},{"category":"useful","title":"when connecting buttons, the blue box doesn't show up ! please help"},{"category":"useful","title":"I’m so stuck and frustrated !! It says I can’t install Xcode because macOs version 10.14.3 or later is required 🥵"},{"category":"useful","title":"Betas aren't actually as bad as he says they are."},{"title":"You're great, yet all over the place. Will I become you once I learn to code?","category":"not useful"},{"title":"Hi can I get the assets link to download.","category":"not useful"},{"category":"useful","title":"Hi ! Allen i learning ios but how to start...."},{"category":"not useful","title":"Awesome content!"},{"title":"There goes whatsapp exposed! Thanks! GOD BLESS genius!","category":"useful"},{"category":"not useful","title":"Take off the word button helped me. Thanks."},{"category":"not useful","title":"Good video. I am a c# and Python programmer and enjoying other languages, looking forward for more Swift videos."},{"category":"not useful","title":"Thank you Angela!"},{"category":"useful","title":"Thanks for making this tutorial! Can you help with this error? UIButton.currentTitle must be used from main thread only"},{"category":"not useful","title":"Great course. Just want to know if it has been updated to account for iPhoneX"},{"category":"not useful","title":"What no Country?! :D  Great video man."},{"category":"not useful","title":"Though I can’t find the zip file, but I just found the similar images in google and edit them on the online photo editor. At last, I built up the dice App."},{"category":"not useful","title":"Thank you for the video. I would love to know when the new video will be out."},{"category":"not useful","title":"\"Malformed config.xml file!\""},{"title":"I've made it this far.\nKeep up the awesome work.","category":"not useful"},{"title":"Great vid. Thanks a lot. I've learned a lot","category":"not useful"},{"category":"not useful","title":"@Sean Allen Hi Allen can you please make some more videos on AVAudioSession, AVAudioEngine how to manipulate songs how to mix songs and all, please its a humble request"},{"title":"Thanks a lot for this tutorial, I just finished the WarCardGame and put that on my iPhone. \n\n\nRegards\nAndreas Falk","category":"useful"},{"title":"ooooh.. i don have money to buy, but i need to learn please","category":"not useful"},{"category":"not useful","title":"Hey Derek, do you by any chance recommend any computer architecture books?  Just figured I'd ask here since it's the most recent video. Hope you're doing well."},{"title":"My question: I have no experience for coding,  can I use your course to learn to make an app for task management? And how long can I master necessary skills for the app? Thanks a lot!","category":"not useful"},{"title":"The resolution of your computer is very high. Please consider reducing it from next video. It would help a lot of people.","category":"not useful"},{"category":"not useful","title":"Thank you. Looks like Adobe changed the way you download the software. Guessing we have to pick Desktop version. I had to search for it. Maybe because I already have an Adobe account."},{"title":"We missed you😃","category":"not useful"},{"category":"not useful","title":"Can you give me a link to download your mac wallpaper? I thought it was really cool!"},{"category":"useful","title":"I'm german and I want program my own app at swift and you give me a chance to lerne the basics thanks for this video i hope you can do a tutorial for code his own app at swift4 on iMac."},{"title":"😍Thank you sirrrr, , , , after a  long break, , ,, finally with this awesome series!!!! Awwww Totally Awesome!! \n\n#LoveFromBangladesh❤❤💚🧡💙💜💛","category":"useful"},{"title":"I'm about 2.5 hours into this video as a new programmer, once this is finished and I've played around and experienced a bit more of these concepts, what do you recommend as a next step?","category":"useful"},{"category":"useful","title":"Best tutorial for iOS  but what about android how to build an Android app."},{"category":"useful","title":"Hey, Adobe trainer here of 12 years, you have a really great teaching style, your videos are fantastic. I did a quick scan of your site, can you tell me if you have a video covering certs and signing apps for deployment?"},{"category":"not useful","title":"Great video. All i needed to really break through the ice of coding."},{"title":"when i play a song it works however if i press stop and try to play another genre nothing happens \ngreat vid \nthanks in advance","category":"not useful"},{"category":"not useful","title":"türkçe dil desteği var mı?"},{"category":"not useful","title":"I'm a mobile dev for Android my company went and changed to use flutter but still has an iOS app to maintain and I have to maintain this iOS app and know nothing about swift and xcode other than casually changing bits a pieces over the last year, literally about to pay for a course in iOS app so will also be using your tutorials many thanks"},{"title":"How to Play Videos mp4 or mov in UITableViewCell in Swift4 - iOS please i want to learn that :)","category":"not useful"},{"category":"not useful","title":"You have the most beautiful smile in the world!"},{"category":"useful","title":"Hi I was wondering how to make a app that lets me be the middle man In selling a sellers product pleas respond thank you"},{"category":"not useful","title":"Thanks man this is amazing content ."},{"category":"not useful","title":"can't wait for the next video!! the more sophisticated the better! would love to see one app that is super simplistic on the front-end but has a lot of different stuff going on in the background! thanks Derek!"},{"category":"not useful","title":"Did everything the same but when I click on the Power button in the simulator, it does nothing. Latest XCODE and MacOS Mojave."},{"category":"not useful","title":"Hello... I love watching you, however, am a beginner and I would like you to teach me more"},{"category":"useful","title":"I subbed and turned on post notifacations\nyour tutorial was extremely helpful im excited to learn more"},{"category":"useful","title":"also my side bar is listed as different names, like i dont have a main.story board for some reason"},{"category":"not useful","title":"Android development course access is denied"},{"category":"not useful","title":"I like it, thank you for sharing."},{"category":"useful","title":"Yeet"},{"title":"How can I keep the music playing in the background while the app closed? Nice vid","category":"useful"},{"category":"useful","title":"i want to make an app for my school district that tells a or b days"},{"category":"not useful","title":"is it possible to install app store in xcode emulator?"},{"title":"This is amazing. thanks a lot for your video. Can you please also tell how to use my existing mobile ready website in app, like webview Android app","category":"not useful"},{"category":"not useful","title":"This guy: \"Do you want to learn programming?\"....\" Then, hire someone else\" 😆"},{"title":"Wow thanks so much, I even made it work on the iPhone X similar and look perfect!","category":"not useful"},{"category":"not useful","title":"Hey Derek, first thanks for all the videos your probably the reason I got a B in my Data Structure class for java. Anyway, I'm having different errors once we complete adding all textfields and labels, its 3 conflicting constraints and Unsupported configuration. I went back and double checked all the data for the constraints and that they were set to view, any thoughts? Also when I try to change them to 0 they keep snapping back to 20"},{"title":"Hi, thank you for making these videos. I just got started and my buttons/options look different with the updated version. Not sure how to navigate without all the same buttons yours shows","category":"useful"},{"title":"1:25 Tried this back in 2012 when there were not as much tutorials. I got nowhere.","category":"useful"},{"category":"useful","title":"I paid  for this course on udemy and you mean to tell me i could watch this free on youtube wtf !"},{"category":"useful","title":"What would i need to do if i wanted to upload this app to google play?"},{"category":"not useful","title":"Heya there! Where can i find the next lesson following this one? Ive searched your playlist but i ve found a completely different course( this tutorial was not one of them)"},{"category":"useful","title":"Just came across you website and ur program! I’m going to desicate my time into learning making an app. I want to understand and learn all the steps and processes that come along with building an app because I’m planning to build a platform for sharing and discovering work. Thank you for this great opportunity and I hope it will provide me a gold guideline and skills to change my idea into a great platform and app."},{"category":"not useful","title":"I really love the way you summary what you have done after each section. It is really help me to digest the information. Keep up your good work!"},{"category":"not useful","title":"speaking fluently and friendly at the same time ... thank you"},{"category":"useful","title":"I just finished that Treehouse app! Mines better!! Lol."},{"category":"useful","title":"Thank you! I just created my first test web app and this was exactly what I was looking for right now!"},{"category":"not useful","title":"Time to switch to SwiftUI eh?"},{"category":"not useful","title":"I've been looking at IOS/SWIFT/XCode tutorials for years on and off. It never really clicked. This video with Angela was FANTASTIC and I now \"get it'.\" At least this example. I think she picked the right easy app to teach about, and she is much more thorough than any of the other teachers I've studied from. Will try to find her course at Udemy if it's updated for the latest Swift and Xcode."},{"category":"useful","title":"Sean, I love your videos, really clean way to teach this stuff, Looking forward to more of these awesome videos!!"},{"category":"not useful","title":"hi.The notepad plus plus doesnt work...what should I use?\n#"},{"category":"not useful","title":"Hey! Great video. How are you able to see the storyboard phone and .swift page with the code at the same time? Like at 14:04"},{"title":"Im about to buy your iOS course Angela. But will you be there if any questions I ask on Udemy ? And will the course be updated if necessary ?","category":"not useful"},{"title":"Hi chris how long does it take to be an ios developer for someone with no prior programming experience & is it still a good career path?","category":"useful"},{"title":"HOW DO I MAKE A FOLDER!!!","category":"not useful"},{"category":"useful","title":"following your steps took me nearly two hours and on top, we will go for the second part? this was very basic I felt really frustrated."},{"category":"useful","title":"Your teaching style is amazing very well done. Im signing up for the 7 day action plan. I need help with getting my Xcode set from scratch. What do I need checked or unchecked? I must not be in the same screen settings because my borders don't give me the same icons you have. Do you have anything on starting from opening excise to swift and what you do to have your platform the way it is? Again awesome content"},{"category":"not useful","title":"thanks for the easy tutorial, many of them take too long and i don't get what they're saying."},{"category":"not useful","title":"1:44:14 Since the indexes can't be negative so why not to create the indexes Unsigned in the first place?"},{"category":"not useful","title":"Links don't work. Disliked and reported"},{"category":"not useful","title":"are the links correct? I think they are leading to something else"},{"title":"I know nothing about coding but I can sense you’re awesome person providing free knowledge. Greedy people don’t share anything. Thank you and subscribed!","category":"useful"},{"category":"not useful","title":"This course is really best. Ms Angela teaches in it. I just love hearing to her talent."},{"title":"Yet another great contribution by Derek Banas, many thanks!","category":"useful"},{"category":"not useful","title":"I cant find the link of the dicee image that angela said she already put it on the description for us to copy and paste. Can you help me get that link?"},{"category":"useful","title":"I'm making this app that helps people to research things"},{"category":"useful","title":"Where do I find the little logo things he was talkin about"},{"title":"Thanks a lot go ahead","category":"useful"},{"category":"not useful","title":"thanks for the videos, however, I observed that all your links are failing. Do something about them"},{"category":"not useful","title":"Time to switch to SwiftUI eh?"},{"category":"useful","title":"Perfect guide for starting of in XCode! Thank you very much!"},{"category":"not useful","title":"Aaaaagh!! Her smile!\nNeed to get some air.\nLil' warmish."},{"category":"not useful","title":"To do it you need basic computer knowledge or what?"},{"category":"useful","title":"This was just a little confusing for me but I’m going to work at this until I understand it. Never give up guys"},{"category":"useful","title":"Dude, I really love your channel. Been a designer for over 20 years and am wanting to learn more about building apps. Your style, speed and voice are all perfect."},{"category":"not useful","title":"Idk can’t code just does weird stuff and yes I’ll give up"},{"category":"useful","title":"Thank you for your videos. Great explanations, really makes me (finally) understand the code (as opposed to just copying it). Been coding for about a week now, only following your courses and with some creativity involved its incredible to see how much Ive learned.\n\nJust a suggestion for a follow up on this one: multiplayer war cards over wifi? :-)"},{"category":"useful","title":"First time on his channel and its my first time watching his video and I already love this guy"},{"title":"From Vietnam with love! Hope you and your loved ones stay safe from nCoV pendamic!","category":"not useful"},{"title":"when im trying to connect my UIViewController to main.storyboard its just typed UIcontrol","category":"not useful"},{"category":"not useful","title":"Something about a chinese woman got DANG good job"},{"category":"useful","title":"Thanks boss, just made my first app and I feel proud."},{"category":"useful","title":", can you do the same for android\nAnd thank you you are really the"},{"category":"not useful","title":"I started learning basic Swift awhile ago and decided to jump into making a basic app just for fun. Very good tutorial! I actually somewhat understand what's going on 😮 I ran the app on my phone and the app crashes when I tap \"calculate\" before inputting a price and sales tax.\n        }"},{"category":"useful","title":"You are a legend, an amazing legend"},{"title":"Hi, Chris, I've just watched your first lesson and I will be watching them all over and over again I think.  I have never coded anything in my life so expect a lot of questions","category":"useful"},{"category":"useful","title":"Thank you Chris, a really nice introductory course :D"},{"title":"why do you teach so good? what's the motivation, because it cant be youtube money.","category":"useful"},{"category":"not useful","title":"she s so damn cute though :*"},{"title":"Awesome","category":"not useful"},{"category":"not useful","title":"Love yaa buddy. You are great🔥🔥🔥🔥🔥🔥🤘🤘🤘🤘🤘🤘"},{"title":"It worked! Thanks buddy :)","category":"useful"},{"category":"useful","title":"Thank you for this great video! Keep up the good work :)"},{"category":"not useful","title":"How do you expect anyone to keep up with you. I was pausing and going back every 5 seconds"},{"category":"useful","title":"Great video. Easy to follow. Looks WAY more enjoyable and easier than programming for android. The voice is also clear, sounded like a british english.\n\nDamn it. I really need to buy macbook pro 2018 and an iphone xs max :( for a cheap price of $5,000 total.\n\n\nThe demo is also about making a casino game, what a perfect gal. Thanks Angel."},{"title":"\"It looks like x-code has experienced an internal error...\" \"Usually these are fine...\" Really? Maybe we should raise our standards.","category":"useful"},{"category":"useful","title":"Don’t know what happen i end up making a time travel app"},{"category":"useful","title":"Hey Chris \nQuestion \nFor Your User Interface where do you make the designs of your button's\nDo you use adobe photoshop what do you use"},{"category":"not useful","title":"Devslopes I downloaded IOS 11 Beta like a month ago and my iPad mini 2 runs fine other than a few expected bugs (because its a beta)"},{"category":"not useful","title":"Great video! this is the second one that has ever worked for me1 just slow down a bit plz"},{"title":"I plan to go from a frontend developer to a iOS developer im 2020. But confused, should i learn storyboards or should a create then UI via code? Or learn SwiftUI directly?","category":"not useful"},{"category":"not useful","title":"I want to make a web-based application and I want it to be a Windows App and I want the Live box to work."},{"title":"Over more than 20 online courses I've taken, Angela is by far, the best IT online teacher I ever had.","category":"not useful"},{"category":"not useful","title":"1:28:34 You are mistaken image views can take actions madame."},{"title":"I want to make a app for Snapchat, so people can find friends","category":"useful"},{"category":"useful","title":"You change your title from 2019 to 2020"},{"category":"useful","title":"If you run into any issues while building this, please let me know. Happy to help clear things up and get you going again."},{"title":"I always install iOS beta so I can help find bugs.","category":"not useful"},{"category":"useful","title":"This tutorial is so great! I followed you and made my first app. BTW I am from China, so I also trained English at the same time. Thank you so much Chris! /:hug"},{"category":"not useful","title":"Can I do everything you did using an ASUS instead of a MAC?"},{"title":"Would you consider discussing compensation for developing an app for my business?","category":"useful"},{"category":"not useful","title":"Two years ago: no idea how do I start to code!!\nNow: expert in coding but where my hair goes?????💀💀"},{"category":"not useful","title":"I wanted to make an app but I have a chromebook :("},{"category":"not useful","title":"You're a great instructor. Excellent video."},{"category":"not useful","title":"Thanks Derek!"},{"category":"not useful","title":"I love this, but as someone who isn't very good at coding wants to work with iOS as a career, I have ADHD and this is a long video lol. Is there any way you can make this a more edible series of videos Angela? I would appreciate it!"},{"category":"not useful","title":"Made it this far...27:00 and still going"},{"category":"useful","title":"Great Tutorial. Thanks a bunch. Giving up on Cordova and PhoneGap and going to dev for real!!!"},{"title":"Thank you!","category":"not useful"},{"category":"useful","title":"This is a literal answer to my prayers. Thank you for sharing this...and having so much patience. ❤️❤️"},{"category":"not useful","title":"Thank for you this!!!!!!!!\nI did four years of computer science in high school and I needed a refresher on app making"},{"category":"not useful","title":"It will not let me upload my zip file, it says:\"Failed to find html\". please help me."},{"category":"not useful","title":"Thanks for getting me started. Secret Link at the end of this video is a dead link."},{"category":"not useful","title":"you are amazing, thanks for sharing. good teacher"},{"category":"useful","title":"Hey Chris - Really great job!  You took on tackling UX and OO all at once, and you did it with a fantastic grace and simplicity.  (Not for the feint of heart!)   Your flow is simple, clear, and useful.  As a 25 year Java veteran, I found this to be an extremely helpful and an informative kickstart for my own learning of SWIFT.   Thanks for putting this together!  Thumbs-up!!!"},{"category":"useful","title":"She is by far the best Swift lecturer. Bought the course. 500 hours for 11$ take my money."},{"category":"useful","title":"You ARE amazing Chris! This tutorial is so well done! Look forward to many more!"},{"title":"Hey u helped me so much I made my own social media it took years but it’s done check it out Flashtrend in the App Store","category":"useful"},{"title":"Do (another) Android tutorial. Even if it's a quickie","category":"not useful"},{"category":"useful","title":"dude you're such a great teacher wtf school never taught me this"},{"title":"I cant seem to receive the 7 Day App Action Plan, checked my spam cant find..dont know what could be wrong","category":"not useful"},{"category":"not useful","title":"Hey Bro ! Wonderful video... I got some projects going on could we get in contact by private?"},{"category":"not useful","title":"Subscribed. I've been looking for a way to do this for a while now. Thank you!! Looking forward to more videos on incorporating more features."},{"category":"not useful","title":"worked perfectly, thanks devslopse..this boosted my confidence.."},{"category":"useful","title":"*_When YouTube Tutorials have more sense than school_*"},{"title":"This was very helpful. Thank you!","category":"not useful"},{"category":"useful","title":"Why I dont have the mainstory board shown in my xcode when I did the exact same thing"},{"category":"useful","title":"in the assistant editor, I cannot edit/ add things to the code. In the video, it shows automatic then ViewController.swift. For mine it shows automatic then UIViewController.h how do I fix this?"},{"category":"useful","title":"CHris:  Can I build an app with a IPad Pro or do I need an apple computer?"},{"title":"I am 24yo and just started to dive in the world of programming, thank you for you video!","category":"useful"},{"title":"I did everything wright but when I was uploading the app the Name I wrote didn't change. Still showed PhoneGap Example. Did I do something wrong?","category":"not useful"},{"category":"not useful","title":"Decent tutorial but a lot of problems not addressed"},{"category":"useful","title":"Love the way you teach Chris. Everything seems so easy :)\nGreat job!"},{"category":"useful","title":"Yeet"},{"title":"Hi Derek, my name is Jason Tatton and I'm the creator of the Concurnas programming language. Concurnas is a new open source JVM programming language designed for building reliable, scalable, high performance concurrent, distributed and parallel systems. More information can be found here: https://concurnas.com/\r\n\r\nWould you be interested in making a video covering Concurnas? I'd be happy to help!\r (Contact details can be found here: https://concurnas.com/concurnasltd/contact.html)\n\r\nWhat distinguishes Concurnas from existing programming languages is that it presents a unique, simplified means of performing concurrent, distributed and parallel computation. These forms of computation are some of the most challenging in modern software engineering, but with Concurnas they are made easy. Utilizing Concurnas to build software enables developers to easily and reliably realize the full computing power offered by today's multi-core computers.","category":"useful"},{"category":"not useful","title":"Wow, awesome one of the best I ve ever seen... excellent!!!!"},{"title":"This is the best ios app development course i have seen ever came across","category":"not useful"},{"category":"useful","title":"Chris, you should create a new playlist with these new videos, split the new and old videos, so then it would be organized."},{"category":"not useful","title":"Fantastic! HTML is your friend!\nDoes this work with Js snippets?"},{"category":"not useful","title":"Hi, how can I get in touch with you to discuss building a new type of app"},{"title":"Tight video, we can always rewind. Everything you need, nothing more, and it works.  Thank you.","category":"not useful"},{"category":"useful","title":"i really enjoyed this thank you"},{"category":"not useful","title":"Can you please unlock my iCloud"},{"title":"If the script can open/read/write to a csv file then all is well. Luv what I've just learned. Shukran, as we say in Arabic, that was thanks.","category":"useful"},{"category":"not useful","title":"Hi please can you help me it says ‘malformed config.xml’ when I try to upload the .zip file to phonegap.com please can you help me thanks"},{"category":"not useful","title":"The app is so small but I really have learned a lot from it. A lot thanks man for the tutorial. ❤️"},{"category":"not useful","title":"Wow! This is exactly what I have been looking for."},{"category":"useful","title":"who else watched the whole thing?"},{"category":"useful","title":"Whos this clean shaven, uncomfortable on cam guy here!? Its been fun watching how far you have come bro. Keep it up :)"},{"title":"Love you man🤘🏻🤘🏻","category":"not useful"},{"category":"not useful","title":"Honestly i just quit the udemy course cause i hate macs plus i had to code on my sis old mac and i am very used to windows. Now i am a happy python coder :)"},{"title":"Where can I download the assets for hustle mode","category":"not useful"},{"category":"not useful","title":"Thank you! Finally a tutorial that gets us hands-on without going into a deep-dive on all the options in the app. This was fun!"},{"category":"not useful","title":"Thank you Angela, you are a great teacher btw. ;)"},{"category":"not useful","title":"1:36:50 WHERE IS THE CHEAT SHEET?"},{"category":"not useful","title":"It was amazing soon gonna buy whole course from Udemy. Brad is web development same is Angela for iOS..."},{"category":"not useful","title":"Thanks for the video. Really helpful!"},{"category":"not useful","title":"Thank you so much for this video. Where is the asset link?"},{"category":"not useful","title":"My phone isnt loading the mobile web page when i scan the QR code any suggestions or am I missing anything"},{"title":"great video, but... an app that u can't use in the simulator?","category":"useful"},{"category":"useful","title":"3:50 I can’t find the little box of option in the lower right"},{"title":"Thank You so much for this lesson, so straight forward! I plan to make a buy and sell type app that takes 10% of every sale and puts it into a charity that the users of the app chose. thanks again!","category":"useful"},{"category":"useful","title":"hi it says a later version of Mac is needed to download Xcode on my Mac, why is that? is there anything I could do to download the program? how do I update the version?"},{"category":"useful","title":"Hi Chris! I'd like to start by saying how amazing your tutorials are! You have such a talented gift, and instead of using it for yourself, you have the heart to share your knowledge with the entire world. Thank you! I am currently up to 1h07min and am having a bit of trouble making the green image cover the entire screen of the phone. I do the exact steps as you mentioned in the video, however, I use iPhone 11 Pro Max, and my results don't match up to yours. The green image on my code doesn't fill the entire phone with green and instead leaves a small margin of white around the entire phone."},{"category":"not useful","title":"5$ per hour for programming? Wow, such a clown"},{"category":"not useful","title":"best iOS course on Udemy. Very well explained and it is well documented."},{"category":"useful","title":"Chris wish me luck I'll talk to you when I finish making it but can you patent an app? If you can how so please help I'm scared my idea is gonna be gone in seconds"},{"title":"Hi","category":"not useful"},{"category":"useful","title":"When you make an app with x code, does the final app have any x code logo or branding?"},{"category":"useful","title":"Absolutely Amazing Tutorial, and its free! Cant wait to start building my idea."},{"category":"not useful","title":"Hi, i got up to the part where you upload the zip file to Adobe and when I click upload nothing changes :*( plz help!"},{"title":"I can’t find the images where are they","category":"not useful"},{"category":"not useful","title":"I certainly gonna need this one for my store! But still need to do more research about this stuff. Thanks!"},{"category":"not useful","title":"Hello there. It is very interesting your video tutorial. It would be really interesting if you make a \"tap the ant\" clone or maybe a \"Fruit Ninja\" clone or some kind of smash game just in 2d."},{"category":"not useful","title":"Awesome Teacher"},{"title":"Is it just me or does she do Hello World app twice? - once @20:15 and then again @47:00?","category":"not useful"},{"category":"not useful","title":"Thank You, I learn a lot from this tutorial"},{"category":"useful","title":"Hey Sean, Love your videos and your podcast is doing great. I have decided to give coding a go thanks to you. I am using this tutorial as my starting point and building on the app. I am trying to use IBoutlet to display the album artwork of the currently playing track. But just can't seam to get it to work. any pointers?"},{"category":"not useful","title":"the note ++ isn't working for me as well. would you have a link for others?"},{"category":"useful","title":"🔥🔥🔥🔥🔥🔥🔥🔥🔥Great video ... learned a lot couldn’t do it without you ....Thank you very much .🙏 🙏"},{"title":"Do images you use for backgrounds, etc. have to be sized specifically before you use them in Xcode?  Can I resize images used as a background in Xcode?","category":"useful"},{"title":"It sucks that everyone does tuturials in swift, when for my job i have to use objective c","category":"useful"},{"title":"This video helped me a lot when i got started out, thank you Chris... If you DONT know how to use Xcode and want to partner up with engineers, I just uploaded a video for you.","category":"useful"},{"category":"not useful","title":"at 14:40 I'm on x code 11 and it says it couldn't find any information for the class genre button? help"},{"title":"Hi Chris, i am completly new in programming. I watched many videos in german and in english, but nobody explain that so good like you. With your help is programming much easier that i thought. Im looking forward to the next videos. Thank you.","category":"useful"},{"title":"Thanks for this easy to understand lesson. I’d like to build an app, and am looking forward to learning about the mystery of coding!!","category":"useful"},{"title":"Sean Allen you're awesome! I was able to follow along on Xcode 10.1.. I Love these 30 min app videos, would love to see more of these!","category":"useful"},{"title":"please sir what did you write next after writing oneclick","category":"useful"},{"category":"not useful","title":"I loved this video sooooooo much ❗️❗️❗️❗️❗️❗️❗️❗️❗️❗️❗️🤩🤩🤩🤩🤩 keep up the good work"},{"category":"not useful","title":"I have not felt more rushed watching a tutorial video in my life"},{"category":"not useful","title":"Someone to help me what was done in 3:06"},{"category":"not useful","title":"2020 will be amazing; Derek is back full-time ❣️❣️"},{"category":"not useful","title":"GREAT VIDEO SIR!!!!!! ok please please make a video on how to place admob plugins in that html file please........."},{"category":"useful","title":"Do you need music on iTunes for this to work?"},{"category":"useful","title":"Missing your storyboard? See: https://youtu.be/ea9fCSXGhSU ⚡QOTD: With the skills you're going to learn, are you going to build an app or a game? Let me know!👇 Kick start your own app with my free 7 Day App Action Plan ➡️ http://bit.ly/7dplan"},{"category":"useful","title":"How come xcode asks for my personal info and asked me to sign in five times over without allowing me to"},{"category":"useful","title":"I'm planning on making a social media app and I'm watching your videos now. I have to wait till I get a mac book and an iPhone but I'm basically just going to watch it on here and then draw what   app would look like on the screen."},{"category":"not useful","title":"i really need this for a school project i'm doing passion project and i need to make a app for it thank you"},{"title":"when i select equal spacing, it doesn’t do anything. any help?","category":"not useful"},{"category":"not useful","title":"Great tip from Angela  \" prefering typing over copy- pasting would help you avoid programming errors.\""},{"category":"not useful","title":"Best instructor on udemy"},{"category":"not useful","title":"Watch Next - iOS Take Home Project  - Job Interview Practice - Free Preview - https://youtu.be/MSIe2y6Fee8"},{"category":"useful","title":"Hi Allen ! thanks for your video guide. i'm still confuse how to categories the song types ? can you show sample of coding for inserting of songs type. thanks"},{"category":"not useful","title":"14.67 gb required to install xcode onto my hard drive..........what....."},{"category":"not useful","title":"Very cool and down to earth tutorial. One question: when I click on the  price or tax ratio element, the keyboard doesn't pop up automatically? Any idea why? thanks!"},{"category":"useful","title":"why didnt they teach me this in high school"},{"category":"not useful","title":"Ok~~~~~ you look hot thow~"},{"category":"useful","title":"Create macOS apps as well using Swift/Objective C (Swift recommended)"},{"title":"Very cool and down to earth tutorial. One question: when I click on the  price or tax ratio element, the keyboard doesn't pop up automatically? Any idea why? thanks!","category":"not useful"},{"title":"😍Thank you sirrrr, , , , after a  long break, , ,, finally with this awesome series!!!! Awwww Totally Awesome!! \n\n#LoveFromBangladesh❤❤💚🧡💙💜💛","category":"useful"},{"title":"Awesome video! I tried doing this on my own with assets I created in adobe, but when I drag my background to fit the whole screen, it still doesn't fit the whole phone... any advice to debug?\n\nThanks!","category":"not useful"},{"title":"Man, you talking a bit too fast. Can’t keep up with you. Could you slow it down next time?","category":"useful"},{"category":"not useful","title":"can we build a app on windows running laptop"},{"category":"useful","title":"I'm a complete beginner and I'm so happy I chose this video as my starting point"},{"category":"useful","title":"Any other fellow nerds having mini heart attacks about not having to end statements?"},{"category":"useful","title":"Anyone know why my swift files on the left hand side are named differently? For example I see SceneDelegate and don't see view controller anywhere."},{"category":"useful","title":"The link you provide does it work really??"},{"title":"I know I'm young but this is such a grate tutorial than school cause EVERYONE knows school SUCKS :)","category":"useful"},{"category":"useful","title":"I’m going to make a app and everyone will love it and when I make billions I’m gonna help countries so much I wanna make a change in the world ..❤️"},{"category":"not useful","title":"Can I use a man air book 11”?"},{"category":"not useful","title":"Where is the asset File Link ?"},{"category":"useful","title":"this is the best tutorial in history like literally i got xcode becuz i want to make a app but i dont/cant take coding lessons since im not in highschool yet sadly but thanks to this tutorial i can finally make a app :D thank you"},{"category":"not useful","title":"Are you going to put this on the app store? If so I will buy it just for support. I know it's free on GitHub and I could push it to apple myself but would rather buy it from you lol"},{"title":"Opened it up and all I had was a white screen :(","category":"not useful"},{"category":"not useful","title":"I can't get into the website and that is my first step"},{"category":"not useful","title":"Sweet!"},{"category":"useful","title":"Please help!!! When I open the assistent Editor XCode opens this file: UIViewController.h but not the ViewController. What can I do with this problem?"},{"category":"not useful","title":"how can i get the dice images i cant find the link"},{"title":"Finally not a calculator :D","category":"not useful"},{"category":"useful","title":"Hello Sean, i have an idea about making an amazing app with the music and i would like to get the whole list of songs where the users will have more options to get from. can you let me know how to pull the information and populate it on the tableview? \nthanks a lot for making this amazing videos man. I'm a subscriber from around ~620. i think you are doing an amazing change where a lot of people can change this world. thanks a lot again Sean! hope you have a fantastic day!"},{"category":"not useful","title":"Very effective tutorial and Angela is really pleasant to listen to. Love her accent and effective speaking style."},{"category":"not useful","title":"Hi! Thank you very much for your tutorial! My HTML knowledge is quite minimal. Do you know any way  that I can build the app in another program like Adobe XD, then turn it into code, by chance?\nFrom what I know, Adobe XD is for presentation only, just a mock up of the app.\nAlso, you think I can just make a website in Wordpress and embed it with iframe and have it work on mobile? Or do you know any other way around making an Wordpress website into an app?"},{"category":"useful","title":"hey chris! thanks for the great lessons! im on lesson 8 and the current xcode does not show me viewcontroller.swift\ni did everything you said to do."},{"title":"Wifey😍","category":"not useful"},{"category":"not useful","title":"Wow!! you made it look so easy. WHY?"},{"title":"The way you explain the process is awesome! Step by step and really easy to understand. Thank you","category":"useful"},{"category":"not useful","title":"\"DO NOT USE MAC THINGS THAT ARE IN BETA.\" (10 seconds later) \"Go ahead and download Xcode beta\" 😂 Thanks for the tutorial I'm really excited about it!"},{"title":"How did you learn coding","category":"not useful"},{"category":"not useful","title":"First app baby!  Thank you.  I like how it is fast and doesn't waste time.  I can always pause and replay"},{"title":"Hi Chris, thank you for this great tutorial. I like how you took your time to explain everything in details. I was able to do everything in your tutorial and I didn't want to just silently pass by without saying thanks.","category":"useful"},{"category":"not useful","title":"thanks man it worked perfectly, I ad some bugs i was capable to manage them out ...thanks for the awesome tip... :-)"},{"category":"not useful","title":"Brother thank you very much 😊😊😊"},{"title":"Good evening, I have followed this tutorial and upto to the Dicee section. I added my own images and label and when I play, I get my design, but then it flicks to a white screen and \"Hello World\", but have no \"Hello World\" anywhere. Is \"Hello World\" a default and will always flick to that.  Thanks","category":"not useful"},{"category":"not useful","title":"Derek, if u have interest in making a tutorial on machine learning using tensorflow! Then do it man!"},{"category":"not useful","title":"where's dat swift cheatsheet?"},{"category":"useful","title":"Chris could you have a bigger font on the app developing software so I can actualy see what you I am doing. I cant even read it wearing my  glasses."},{"category":"not useful","title":"you are super helpful and a great teacher. Will be trying this. Thanks!"},{"category":"not useful","title":"This girl looks cheerful and that's given me a good impression"},{"category":"useful","title":"I totally loved this video! thank you! it felt great building my first app!"},{"category":"useful","title":"Do you have a company to recommend that can build and publish an app ... for $5.00 or close per hour"},{"category":"useful","title":"Hey Sean, I encountered a \"Task failed with exit 1 signal 0\" when I tried to run the app. Could you help me out?"},{"title":"Awesome!!! You explained this iOS app development tutorial in great depth, and it really helped me to increase my knowledge of ios app development, also other than such resources I keenly follow blogs of the world’s best iOS apps development firms like GoodCore Software and others because resources like these openly share the latest app development practices, also this really helps me to maintain my edge in development.","category":"not useful"},{"title":"I want to make a web-based application and I want it to be a Windows App and I want the Live box to work.","category":"not useful"},{"category":"useful","title":"Really enjoying your videos, easy to follow and great information!  Really appreciate too how down to earth you are and relatable, the programming world can be intimidating but you make it feel attainable!"},{"title":"it is stunning to me how much value your channel brings to computer science education.  I truly hope the million subscribers you have spend the minutes to share your channel to educators around the globe as a way to super-charge any computer programming course/class/or passionate individual's program.  Here's to you, Derek.","category":"not useful"},{"title":"The instructor is amazing, to listen to. She's so thoughtful in explaining all the intricate details.","category":"not useful"},{"category":"not useful","title":"Flutter or nativescript tutorial please!"},{"title":"Man... you don 't know how long i've thought to myself \"I wish I could just build a webpage and make that into an app\". I needed this for my business, and you've just made me a happy camper. Thank you ! I really hope you continue this series beyond the next video.","category":"not useful"},{"category":"not useful","title":"I have no apple products but I love to develop. Could you do an updated Android app development series?"},{"category":"useful","title":"Hey Sean, firstly, thanks for the great tutorial! Secondly,I know you said you wouldn't get into the topic of unwrapping, but I would like to know how you would unwrap this using either an if let statement, or guard statement. Just want to know how I can avoid force unwrapping if possible, and get better at optional-chaining. Thank You"},{"category":"not useful","title":"is it possible to install app store in xcode emulator?"},{"category":"not useful","title":"There was no fluff at all and it's an entire application with actions and ui elements.  Sure, he's not reversing a binary tree or showing off key fundamentals, but for somebody trying to get into development it gives them all the the basic know-hows to just get started."},{"category":"useful","title":"What’s happens if you want to make an app with more than one page?\n(Great tutorial by the way 😃)"},{"category":"not useful","title":"Awesome Derek, thank u very much! can u make same for android app? or would be awesome tutorial on flutter."},{"category":"not useful","title":"well sounds like what any node.js framework does, there was appJS, it's superseeded by something with a new name, go look it up yourself, if you don't wanna hang on Adobe's needle."},{"category":"not useful","title":"Hello Darek... Can I code IOS phone Apps within linux using vmware os other alternative? if Yes, Could you show us how to do it? I don't have a mac, in Brazil it's a kind of expansive but I wold like to keep folowing your IOS tutorials."},{"category":"not useful","title":"Are you kidding? You constantly create new, up-to-date content that´s easy to take in... and you stay so humble, and grounded.\nKudos, Derek! Thanks for the great video(s) :)"},{"category":"not useful","title":"It's taking me more than ten minutes to find out how to even download!! Note pad ++"},{"category":"not useful","title":"Hey man you're not talking to yourself I appreciate you making these!"},{"category":"useful","title":"Hi Sean, I did everything that you did on the video, however, when I click the three buttons for the genres, my app crashes. Do you have any idea why this happens?"},{"category":"useful","title":"Random 9 year kid:\n\n\n\n\n\"MAKE GTA 6\""},{"category":"useful","title":"Perfect tutorial video! I have just started to learn about coding and app design and this tutorial has been a smooth walkthrough of what to expect going ahead! very keen to watch the rest of the course.\n\n👌🏼👍👍👍"},{"category":"useful","title":"WOW! you are so good at holding the attention :) I want to build a wellness app. \nis this video still current? I've noticed that is Feb 2019"},{"category":"not useful","title":"Angela has a calming voice that makes me want to listen to her."},{"category":"not useful","title":"I have mastered this after the tutorial. \nNow, I am ready to develop an app for ios to let people make an app for ios in ios."},{"category":"useful","title":"I want to build a very simple app, they ask for my company € 25,000 to € 50,000 think it is a bit too expensive. I will try to build it myself, thanks to you😂"},{"title":"How does one select a specific song from the device?","category":"not useful"}]